// main.js — логика главной карты
// Используем изображение карты мира как подложку
const imageUrl = 'IMG/world.webp'; // Путь к изображению карты мира
const imageBounds = [[0,0], [4096,4096]]; // Карта мира: 4096x4096
// Используем CRS.Simple для точного отображения изображения
const map = L.map('map', {
  crs: L.CRS.Simple,
  minZoom: -2,
  maxZoom: 2, // Максимальное приближение в 2 раза
  maxBounds: imageBounds, // Ограничение перемещения ровно по картинке
  maxBoundsViscosity: 1.0 // Жёсткое ограничение
});
L.imageOverlay(imageUrl, imageBounds).addTo(map);
// Масштабирование по ширине 4096px
const mapWidth = 4096;
const windowWidth = window.innerWidth;
const zoomToFitWidth = Math.log2(windowWidth / mapWidth);
map.setView([imageBounds[1][0] / 2, mapWidth / 2], zoomToFitWidth);

// Новые регионы с координатами под изображение
// Каждая область имеет название, регион, цвет, описание и координаты полигона
// АРАМИДИС
const regions = [
  {
    name: 'ЙОШИХАРА', // Название города (будет крупно в подсказке)
    location: 'Арамидис', // Название региона (будет выделено цветом)
    locationColor: '#8EEB00', // Цвет для названия региона Арамидис (#8EEB00)
    desc: 'Йошихара, или как его называют местные люди - “Город розовых слёз”. Город торговли, фестивалей и магии.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/joshixara.124/',
    polygon: [
      [3076, 1184], [3063, 1167], [3036, 1154], [3018, 1162], [3013, 1193], [2999, 1210], [2987, 1235], [2976, 1260], [2956, 1258], 
      [2941, 1278], [2934, 1301], [2932, 1332], [2943, 1351], [2969, 1358], [2986, 1381], [3005, 1407], [3029, 1425], [3052, 1430], 
      [3056, 1407], [3069, 1405], [3082, 1396], [3098, 1381], [3113, 1364], [3130, 1369], [3153, 1382], [3178, 1381], [3197, 1362], 
      [3203, 1339], [3184, 1322], [3168, 1315], [3160, 1304], [3163, 1282], [3141, 1280], [3132, 1269], [3119, 1265], [3116, 1252], 
      [3105, 1242], [3087, 1234], [3070, 1226], [3068, 1210], [3071, 1197], [3078, 1185]
    ]
  },
  {
    name: 'РИКУТЕН', // Название города (будет крупно в подсказке)
    location: 'Арамидис', // Название региона (будет выделено цветом)
    locationColor: '#8EEB00', // Цвет для названия региона Арамидис (#8EEB00)
    desc: 'Город бандитов и контрабандистов.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/rikuten.138/',
    polygon: [
      [2741, 1632], [2749, 1645], [2762, 1633], [2764, 1640], [2753, 1668], [2752, 1700], [2756, 1730], [2770, 1756], [2784, 1774], 
      [2804, 1767], [2824, 1755], [2840, 1747], [2850, 1733], [2852, 1710], [2858, 1704], [2859, 1694], [2851, 1650], [2844, 1641], 
      [2832, 1644], [2825, 1636], [2808, 1637], [2803, 1627], [2794, 1616], [2786, 1613], [2776, 1623], [2770, 1613], [2783, 1590], 
      [2775, 1576], [2741, 1631]
    ]
  },
  {
    name: 'КОУФУ', // Название города (будет крупно в подсказке)
    location: 'Арамидис', // Название региона (будет выделено цветом)
    locationColor: '#8EEB00', // Цвет для названия региона Арамидис (#8EEB00)
    desc: 'Промышленный город в гораз Формауцнтин', // Описание (любой текст)
    forum: 'https://enterum.ru/',
    polygon: [
      [3158, 1817], [3174, 1852], [3191, 1855], [3192, 1890], [3168, 1901], [3161, 1927], [3148, 1934], [3117, 1935], [3092, 1934], 
      [3086, 1927], [3079, 1906], [3075, 1874], [3079, 1845], [3091, 1821], [3098, 1812], [3121, 1822], [3142, 1816], [1983, 1571]
    ]
  },
  {
    name: 'ИГРИДАС', // Название города (будет крупно в подсказке)
    location: 'Арамидис', // Название региона (будет выделено цветом)
    locationColor: '#8EEB00', // Цвет для названия региона Арамидис (#8EEB00)
    desc: 'Город вмещает в своих стенах четыре разных народа: людей, гномов, зверолюдей и эльфов.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/igridas.64/',
    polygon: [
      [1991, 1370], [2024, 1352], [2034, 1355], [2039, 1371], [2048, 1377], [2055, 1390], [2053, 1398], [2059, 1415], [2070, 1432], 
      [2069, 1445], [2092, 1444], [2103, 1455], [2110, 1471], [2098, 1478], [2088, 1481], [2075, 1482], [2070, 1498], [2076, 1499], 
      [2089, 1517], [2076, 1535], [2049, 1537], [2040, 1552], [2035, 1550], [2019, 1562], [2014, 1558], [1996, 1570], [1990, 1567], 
      [1970, 1559], [1949, 1538], [1937, 1516], [1929, 1504], [1924, 1484], [1925, 1446], [1934, 1417], [1963, 1376], [1975, 1367] 
    ]
  },
  {
    name: 'ИРОНХОЛД', // Название города (будет крупно в подсказке)
    location: 'Арамидис', // Название региона (будет выделено цветом)
    locationColor: '#8EEB00', // Цвет для названия региона Арамидис (#8EEB00)
    desc: 'Крепость на востоке от Игридаса.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/ehlgardijskaja-respublika.35/',
    polygon: [
      [2615, 1278], [2627, 1289], [2657, 1300], [2669, 1321], [2673, 1342], [2674, 1354], [2699, 1364], [2672, 1373], [2685, 1376], 
      [2694, 1395], [2681, 1410], [2664, 1410], [2658, 1423], [2628, 1432], [2612, 1456], [2599, 1477], [2569, 1458], [2551, 1437], 
      [2539, 1417], [2532, 1390], [2530, 1363], [2543, 1309], [2564, 1279], [2599, 1255]
    ]
  },
  {
    name: 'КАРТУС', // Название города (будет крупно в подсказке)
    location: 'Арамидис', // Название региона (будет выделено цветом)
    locationColor: '#8EEB00', // Цвет для названия региона Арамидис (#8EEB00)
    desc: 'Небольшой, но оживленный пригород, расположенный на южных подступах к крепости Иронхолд.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/ehlgardijskaja-respublika.35/',
    polygon: [
      [2512, 1541], [2520, 1551], [2537, 1570], [2538, 1583], [2526, 1606], [2513, 1641], [2509, 1643], [2488, 1648], [2475, 1636], 
      [2476, 1557], [2487, 1543]
    ]
  },
  // НЕЗАВИСИМЫЕ ПОСЕЛЕНИЯ АРАМИДИС
  {
    name: 'ДЖИЮ-МУРА', // Название города (будет крупно в подсказке)
    location: 'Арамидис', // Название региона (будет выделено цветом)
    locationColor: '#8EEB00', // Цвет для названия региона Арамидис (#8EEB00)
    desc: 'Джию-Мура ("Свободная Деревня") — поселение беженцев из Аргадара на берегу Волчьей Реки.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/dzhiju-mura.1108/post-40691',
    polygon: [
      [2361, 1274], [2336, 1284], [2322, 1311], [2322, 1338], [2332, 1363], [2346, 1373], [2371, 1377], [2394, 1364], [2411, 1319], 
      [2391, 1301], [2373, 1300], [2359, 1277]
    ]
  },
  {
    name: 'АР-РУСАЙФА', // Название города (будет крупно в подсказке)
    location: 'Арамидис', // Название региона (будет выделено цветом)
    locationColor: '#8EEB00', // Цвет для названия региона Арамидис (#8EEB00)
    desc: 'Город на берегу моря, который когда-то славился своими обширными туристическими возможностями.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/dzhiju-mura.1108/post-40691',
    polygon: [
      [3241, 987], [3229, 971], [3216, 950], [3236, 891], [3249, 876], [3257, 872], [3265, 873], [3293, 826], [3298, 826], 
      [3324, 873], [3329, 875], [3330, 882], [3323, 894], [3319, 894], [3310, 881], [3307, 881], [3304, 887], [3300, 888], 
      [3293, 901], [3337, 902], [3344, 908], [3337, 913], [3287, 914], [3287, 918], [3295, 924], [3297, 930], [3295, 937], 
      [3287, 946], [3284, 945], [3283, 948], [3289, 950], [3284, 955], [3279, 956], [3272, 964], [3259, 963], [3256, 968], 
      [3247, 968], [3245, 974], [3289, 977], [3300, 981], [3290, 984], [3259, 987]
    ]
  },
  {
    name: 'ЛИНВАР', // Название города (будет крупно в подсказке)
    location: 'Арамидис', // Название региона (будет выделено цветом)
    locationColor: '#8EEB00', // Цвет для названия региона Арамидис (#8EEB00)
    desc: 'Деревня является одним из перевалочных пунктов торговцев и простых авантюристов.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/dzhiju-mura.1108/post-40691',
    polygon: [
      [1854, 1005], [1881, 1042], [1886, 1053], [1893, 1062], [1874, 1079], [1867, 1081], [1875, 1089], [1883, 1105],
      [1866, 1113], [1838, 1126], [1828, 1127], [1821, 1126], [1796, 1083], [1793, 1065], [1800, 1032], [1809, 1020], 
      [1820, 1005], [1826, 998]
    ]
  },
  // ЮНИОН
  {
    name: 'ИДО', // Название города (будет крупно в подсказке)
    location: 'Юнион', // Название региона (будет выделено цветом)
    locationColor: '#73C2FF', // Цвет для названия региона Юнион (#73C2FF)
    desc: 'Высокотехнологичный город, люди в котором вследствие генетических экспериментов были разделены на две подрасы - ренов и скиттов.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/gorod-ido.51/',
    polygon: [
      [1864.25, 2140.75], [1920.5, 2141.75], [1922.5, 2146.5], [1930.5, 2147], [1937.5, 2159.75], [1977.5, 2160.25], [1980.25, 2163.25], 
      [1984, 2163], [1990, 2175.5], [1985.75, 2185], [1980, 2184.5], [1976.75, 2189.5], [1945.5, 2190.75], [1948.75, 2194.75], [1990.75, 2193.75], 
      [1996.5, 2199.25], [2028, 2199.75], [2046.5, 2218], [2025.5, 2231.75], [2012.75, 2231.5], [2004, 2238.25], [1961, 2238.25], 
      [1955.75, 2244.5], [1901.5, 2244.5], [1903.5, 2248.25], [1975.75, 2249.25], [1978.5, 2253.25], [1982.5, 2252.75], [1990.5, 2266.25], 
      [1983, 2282], [1978.25, 2282.25], [1975, 2286.5], [1924.5, 2286.75], [1923.5, 2287.75], [1861.75, 2288.25], [1854.75, 2276.75], 
      [1839, 2277], [1830.25, 2265.25], [1838, 2249.75], [1833.5, 2239], [1831, 2226.5], [1829.75, 2210.5], [1831.5, 2198.25], [1835.25, 2186.5], 
      [1841, 2175.75], [1848.75, 2170.25], [1848.5, 2167.5]
    ]
  },
  {
    name: 'ДЖЕВЕЛ-СИТИ', // Название города (будет крупно в подсказке)
    location: 'Юнион', // Название региона (будет выделено цветом)
    locationColor: '#73C2FF', // Цвет для названия региона Юнион (#73C2FF)
    desc: 'Туристическая мекка, в которую могут попасть все желающие по подводному тоннелю или по морю.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/dzhevel-siti.50/',
    polygon: [
      [1534, 2682], [1578.75, 2608.5], [1587.75, 2612.5], [1615, 2613.25], [1616.75, 2616.25], [1621.75, 2616.25], [1623.75, 2620], 
      [1640.75, 2620], [1645.5, 2628.5], [1653, 2631], [1665.5, 2632.25], [1673.75, 2635.5], [1674.25, 2640.25], [1689.5, 2641], [1691.5, 2645.5], 
      [1695.75, 2646], [1696.5, 2648], [1721.25, 2650.5], [1697.75, 2655.25], [1692.5, 2657], [1687.5, 2662.75], [1678.5, 2663.5], [1675, 2668], 
      [1649.75, 2669], [1649.75, 2674.25], [1656, 2674.25], [1657.5, 2677.75], [1693, 2678], [1695.5, 2682.75], [1700.25, 2682.75], [1703, 2686.25], 
      [1711.5, 2686.75], [1714.5, 2690], [1719.25, 2689.25], [1721.75, 2692.5], [1738, 2694.25], [1720.75, 2697.5], [1719, 2699.75], 
      [1713.5, 2700.75], [1711.25, 2702.25], [1704.25, 2703.5], [1702.25, 2706.25], [1688.5, 2707], [1685.5, 2712.25], [1670.25, 2713.25],
      [1666.75, 2716.75], [1672.25, 2720.75], [1679.5, 2732], [1690.25, 2734.25], [1717.25, 2737.5], [1689, 2741.75], [1687.75, 2743.25], 
      [1673.75, 2749.5], [1663.75, 2749.25], [1661.25, 2752.75], [1646, 2753.5], [1643.25, 2756.75], [1632.5, 2758.5], [1617, 2759.25], 
      [1615, 2762.5], [1597.25, 2762.25], [1590.75, 2769.75], [1578.25, 2769.5], [1534.25, 2681.75]
    ]
  },
  {
    name: 'ВИНАС', // Название города (будет крупно в подсказке)
    location: 'Юнион', // Название региона (будет выделено цветом)
    locationColor: '#73C2FF', // Цвет для названия региона Юнион (#73C2FF)
    desc: 'Культурная столица Юниона.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/vinas.126/',
    polygon: [
      [2584.5, 2090.5], [2605, 2103.5], [2627.25, 2091.5], [2638.75, 2086.25], [2660, 2103], [2690, 2153], [2662.75, 2166.25], 
      [2661, 2187], [2654.75, 2208.5], [2670.75, 2217.75], [2637, 2234.5], [2620.75, 2239], [2598, 2242.5], [2584.5, 2244.5], [2575, 2237.25], 
      [2561.25, 2211.75], [2553.75, 2179], [2554, 2152.5], [2558.5, 2134.75], [2565.75, 2118.5], [2574, 2104]
    ]
  },
  {
    name: 'III-СИТИ', // Название города (будет крупно в подсказке)
    location: 'Юнион', // Название региона (будет выделено цветом)
    locationColor: '#73C2FF', // Цвет для названия региона Юнион (#73C2FF)
    desc: 'Поселение разумных машин под предводительством лояльного к органикам ИИ.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/iii-siti.45/',
    polygon: [
      [2763, 2591.75], [2773.5, 2628.25], [2800.25, 2659.25], [2809.25, 2650.5], [2823.25, 2640], [2897.25, 2639], [2913.5, 2542], 
      [2905.5, 2521.25], [2827.5, 2520.5], [2801.5, 2505.25], [2780.75, 2529.5], [2764.5, 2569.75], [2766.75, 2608.25]
    ]
  },
  {
    name: 'КАРЬЕР', // Название города (будет крупно в подсказке)
    location: 'Юнион', // Название региона (будет выделено цветом)
    locationColor: '#73C2FF', // Цвет для названия региона Юнион (#73C2FF)
    desc: 'Территория разрабатываемого карьера.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/karer.277/',
    polygon: [
      [2594, 3112.5], [2604, 3146], [2623.5, 3181.5], [2658, 3185.5], [2675.5, 3201.5], [2691.5, 3207.5], [2704.5, 3214.5], [2746.5, 3203], 
      [2759, 3195.5], [2772, 3172.5], [2760.5, 3156], [2754, 3139.5], [2714, 3092], [2702.5, 3060], [2679.5, 3016], [2655, 3019], 
      [2628, 3020.5], [2604, 3056], [2595.5, 3094]
    ]
  },
  {
    name: 'ЭНИКЕЕВКА', // Название города (будет крупно в подсказке)
    location: 'Юнион', // Название региона (будет выделено цветом)
    locationColor: '#73C2FF', // Цвет для названия региона Юнион (#73C2FF)
    desc: 'Небольшое сельское поселение. Высоко развито технологически, специализируется на животноводстве и растениеводстве, производит массу продуктов для близлежащих городов.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/derevnja-ehnikeevka.61/',
    polygon: [
      [2402.5, 2332.25], [2411.5, 2318], [2422, 2319.75], [2436.75, 2332.25], [2444, 2330], [2448.75, 2323], [2465, 2323.75], [2477.25, 2310.5], 
      [2480.75, 2306.5], [2501.5, 2298], [2490.25, 2272.25], [2472.75, 2265.5], [2470, 2252.75], [2478.5, 2249.25], [2483, 2240.5], 
      [2473.5, 2216.25], [2466.5, 2213], [2456.5, 2196.5], [2445.25, 2190.75], [2435.25, 2191.75], [2425.75, 2196], [2422.75, 2199.25], 
      [2404.25, 2187], [2399, 2188], [2395.25, 2192], [2385.25, 2206.25], [2375.25, 2229.25], [2371, 2252.25], [2373, 2279.25], [2378.5, 2296.5], [2387.5, 2315.5]
    ]
  },
    {
    name: 'СЕРВОПАДОВО', // Название города (будет крупно в подсказке)
    location: 'Юнион', // Название региона (будет выделено цветом)
    locationColor: '#73C2FF', // Цвет для названия региона Юнион (#73C2FF)
    desc: 'Небольшое сельское поселение. Высоко развито технологически, специализируется на животноводстве и растениеводстве, производит массу продуктов для близлежащих городов.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/selo-servopadovo.62/',
    polygon: [
      [2289.25, 2227.5], [2310.5, 2246.5], [2316.75, 2272.25], [2354, 2269.25], [2366, 2281.25], [2355, 2294], [2319.5, 2295.25], 
      [2324.25, 2317.75], [2338.25, 2341.25], [2336, 2354], [2325.75, 2363.75], [2301.25, 2371.75], [2273.75, 2372.25], [2256, 2384.5], 
      [2248.25, 2380.75], [2237, 2366.25], [2223.25, 2341.25], [2216.5, 2313.5], [2221.25, 2268.25], [2230.75, 2243.75], [2241.25, 2228.5], [2250.75, 2217.5]
    ]
  },
  // КОРЗУС
  {
    name: 'АНДАГРА', // Название города (будет крупно в подсказке)
    location: 'Корзус', // Название региона (будет выделено цветом)
    locationColor: '#FFBA40', // Цвет для названия региона Корзус (#FFBA40)
    desc: 'Крепость на руинах одного из уцелевших городов после аномалии', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/krepost-na-ruinax.37/',
    polygon: [
      [1284, 2119], [1289.5, 2128.5], [1303, 2138.5], [1315, 2137.5], [1334, 2141], [1352.5, 2148.5], [1356.5, 2162], [1366, 2174.5], 
      [1382.5, 2179], [1404, 2179], [1392.5, 2190.5], [1403, 2198], [1413.5, 2199.5], [1407.5, 2206.5], [1415.5, 2213], [1398, 2230], 
      [1413.5, 2243.5], [1404, 2245], [1391, 2240], [1386.5, 2251.5], [1401, 2254.5], [1406.5, 2262], [1401, 2272], [1383.5, 2274], 
      [1365, 2279.5], [1371, 2287.5], [1360, 2292.5], [1357, 2297], [1338.5, 2298.5], [1334.5, 2316], [1317, 2314], [1306.5, 2317.5], 
      [1294.5, 2318.5], [1283, 2329], [1256, 2305], [1244, 2291], [1231.5, 2264.5], [1224.5, 2239.5], [1224.5, 2207.5], [1229, 2184], 
      [1243, 2158], [1264, 2134.5], [1276, 2124]
    ]
  },
  {
    name: 'АЛЬФА-МАЯК', // Название города (будет крупно в подсказке)
    location: 'Корзус', // Название региона (будет выделено цветом)
    locationColor: '#FFBA40', // Цвет для названия региона Корзус (#FFBA40)
    desc: 'Крепость на руинах одного из уцелевших городов после аномалии', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/dolina-nezhiti.39/',
    polygon: [
      [1385, 1082.5], [1332.5, 1079], [1309.5, 1071.5], [1291.5, 1038.5], [1281, 997], [1279.5, 977.5], [1275, 951], [1284, 918.5], 
      [1289.5, 878.5], [1297.5, 850.5], [1307, 803], [1327.5, 789.5], [1337, 772], [1356, 766.5], [1378.5, 788.5], [1389.5, 785],
      [1394.5, 765], [1412, 745.5], [1426.5, 754], [1438, 766], [1468.5, 816.5], [1485, 826], [1491.5, 825.5], [1497, 814.5], [1504, 820], 
      [1523.5, 866.5], [1536.5, 902], [1541, 939.5], [1542, 960], [1526, 972], [1512, 1004.5], [1510.5, 1021.5], [1473, 1020.5], 
      [1453, 1016], [1433.5, 1019.5], [1426, 1036.5], [1418.5, 1062.5], [1410, 1079]
    ]
  },
  {
    name: 'БУНКЕР', // Название города (будет крупно в подсказке)
    location: 'Корзус', // Название региона (будет выделено цветом)
    locationColor: '#FFBA40', // Цвет для названия региона Корзус (#FFBA40)
    desc: 'Один из старых бункеров на юго-востоке Пустошей, который сохранился после бесчисленных конфликтов.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/bunker.42/',
    polygon: [
      [688.5, 2065], [725, 2108.5], [727.5, 2128], [745, 2147.5], [786, 2176.5], [788.5, 2188.5], [814, 2211], [813, 2220], [803.5, 2228], 
      [804.5, 2237.5], [840, 2248], [839.5, 2253], [797.5, 2271], [785.5, 2288.5], [772.5, 2303], [742.5, 2322], [725, 2340.5], 
      [718, 2358.5], [693.5, 2388.5], [637.5, 2323.5], [617.5, 2299.5], [607.5, 2263], [607.5, 2228.5], [619, 2190.5], [641.5, 2159.5], [675, 2118.5]
    ]
  },
  {
    name: 'РЕЙС', // Название города (будет крупно в подсказке)
    location: 'Корзус', // Название региона (будет выделено цветом)
    locationColor: '#FFBA40', // Цвет для названия региона Корзус (#FFBA40)
    desc: 'База банды Лиса.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/gorod-rejs-territorija-lisa.1043/post-33530',
    polygon: [
      [1494, 1947.5], [1570.5, 1960.5], [1575, 1966], [1571.5, 1974.5], [1559, 1979.5], [1572.5, 2003], [1593.5, 2008], [1597.5, 2013.5], 
      [1593, 2021], [1570.5, 2024.5], [1558, 2049], [1569.5, 2054.5], [1574, 2061], [1570, 2067.5], [1494, 2078], [1473, 2079.5], 
      [1441.5, 2069.5], [1432.5, 2059.5], [1426, 2038.5], [1423, 2013], [1424, 1999.5], [1430, 1980], [1442, 1954.5], [1472.5, 1950], [1488, 1945.5]
    ]
  },
  {
    name: 'ЯДОВИТЫЕ ДЖУНГЛИ', // Название города (будет крупно в подсказке)
    location: 'Корзус', // Название региона (будет выделено цветом)
    locationColor: '#FFBA40', // Цвет для названия региона Корзус (#FFBA40)
    desc: 'Несмотря на то, что радиация, стёршая с лица Корзуса всё живое и рукотворное, долгое время господствовала в этих гиблых выжженных пустошах, природа в очередной раз показала, что она способна приспособиться даже к подобной катастрофе.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?forums/jadovitye-dzhungli.78/',
    polygon: [
      [837, 1452], [850.5, 1449], [860, 1437], [905.5, 1409.5], [906, 1386.5], [921, 1361], [955.5, 1340.5], [972, 1351], [985, 1342], 
      [1002.5, 1370], [1018.5, 1370], [1030.5, 1345.5], [1036, 1329], [1049, 1327.5], [1060.5, 1313.5], [1080, 1366.5], [1096.5, 1372.5], 
      [1119.5, 1415.5], [1148, 1430.5], [1166, 1428.5], [1176, 1448.5], [1164.5, 1464.5], [1159.5, 1473.5], [1167, 1485], [1154, 1514], 
      [1167.5, 1535.5], [1156.5, 1559.5], [1165, 1569], [1162, 1583], [1165, 1601], [1153, 1614], [1153, 1635.5], [1132, 1662], [1126.5, 1673.5], 
      [1114, 1698], [1101, 1704.5], [1080.5, 1738], [1078, 1762], [1047.5, 1747.5], [1034, 1731], [1018, 1734], [1010.5, 1750.5], 
      [990.5, 1742.5], [977.5, 1736], [953, 1716.5], [924, 1736.5], [915.5, 1724], [899, 1705.5], [873, 1657], [845, 1667], [822, 1636.5], 
      [834, 1603.5], [830.5, 1574.5], [821, 1565], [835.5, 1547], [839, 1515], [839, 1465], [837, 1450.5]
    ]
  },
  {
    name: 'ГНЕЗДО СКРЯГ', // Название города (будет крупно в подсказке)
    location: 'Корзус', // Название региона (будет выделено цветом)
    locationColor: '#FFBA40', // Цвет для названия региона Корзус (#FFBA40)
    desc: 'Гнездо - нейтральная территория, где можно стоять у одного прилавка плечом к плечу со злейшим врагом, выбирая себе сигары.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/gnezdo.1067/post-36448',
    polygon: [
      [1069.5, 964], [1082, 980], [1085, 994.5], [1105, 1011.5], [1130, 1031.5], [1134.5, 1043], [1153, 1061], [1145.5, 1080.5], 
      [1176, 1089], [1175, 1092.5], [1145.5, 1106.5], [1129, 1127], [1103.5, 1144], [1090.5, 1153.5], [1077.5, 1178], [1068.5, 1182], 
      [1037, 1164], [1012.5, 1139], [998, 1112.5], [994, 1072.5], [1000, 1045], [1014.5, 1021], [1031, 1000.5], [1053, 985], [1075.5, 977.5] 
    ]
  },
  {
    name: 'ЛАГЕРЬ АШАРА', // Название города (будет крупно в подсказке)
    location: 'Корзус', // Название региона (будет выделено цветом)
    locationColor: '#FFBA40', // Цвет для названия региона Корзус (#FFBA40)
    desc: 'Несмотря на настороженное и подозрительное отношение к людям и, особо неприязненное, к нежити – мутанты из Лагеря ведут активную торговлю, а также могут, за определенные ценности и пользу, приютить на какое-то время любого страждущего.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/lager-mutantov-ashara.397/post-2879',
    polygon: [
      [547.5, 1664], [560, 1687], [601.5, 1691.5], [614.5, 1742], [602.5, 1755.5], [606.5, 1759.5], [630, 1753], [643, 1747], [654, 1746.5], 
      [671, 1751.5], [673.5, 1761], [664.5, 1770.5], [661.5, 1788], [654, 1796.5], [641, 1796], [618.5, 1807], [610.5, 1803.5], [605, 1792.5], 
      [581, 1795.5], [595.5, 1807], [591, 1817], [579.5, 1821.5], [581.5, 1831.5], [611, 1836.5], [616.5, 1842], [624.5, 1841], [640.5, 1850], 
      [623.5, 1871.5], [588.5, 1884], [562.5, 1893], [545.5, 1891.5], [520, 1900.5], [492, 1880.5], [471, 1855], [458, 1827.5], [451.5, 1795.5], 
      [453, 1764.5], [462, 1732], [481.5, 1700.5], [519, 1669.5], [542.5, 1662.5]
    ]
  },
  {
    name: 'Озеро Гидры', // Название города (будет крупно в подсказке)
    location: 'Корзус', // Название региона (будет выделено цветом)
    locationColor: '#FFBA40', // Цвет для названия региона Корзус (#FFBA40)
    desc: 'Огромное озеро, воды которого пропитаны радиацией.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/ozero-gidry-vysokaja-slozhnost.1292/post-64275',
    polygon: [
      [1313.5, 1805.5], [1305.5, 1840.5], [1292.5, 1866.5], [1303, 1882], [1263.5, 1924], [1243.5, 1917.5], [1240.5, 1898], 
      [1215.5, 1899.5], [1199, 1888.5], [1190.5, 1889], [1188, 1869], [1194.5, 1864], [1204, 1848], [1199.5, 1834.5], [1202, 1824], 
      [1202, 1811.5], [1205, 1803], [1202, 1793], [1222.5, 1772], [1230, 1785], [1238.5, 1756], [1281, 1745], [1286.5, 1751], [1293.5, 1745], [1297.5, 1736], [1331, 1770.5], [1325, 1781.5], 
      [1315, 1804], [1318, 1817], [1311.5, 1826.5], [1312.5, 1837.5], [1305.5, 1839.5], [1294, 1867.5] 
    ]
  },
  {
    name: 'ЗЕЛЕНЫЕ ТОПИ', // Название города (будет крупно в подсказке)
    location: 'Корзус', // Название региона (будет выделено цветом)
    locationColor: '#FFBA40', // Цвет для названия региона Корзус (#FFBA40)
    desc: 'Болота к северу от города Рейс.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/zeljonye-topi.793/',
    polygon: [
      [1601.25, 1614], [1622.75, 1636.25], [1635, 1666], [1644.25, 1683.25], [1654.75, 1693.5], [1653.5, 1699.75], [1647.5, 1707.5],
      [1643, 1718.75], [1644.25, 1745], [1655, 1754], [1656, 1768.25], [1647.25, 1810.25], [1656.75, 1827], [1641.5, 1835.75],
      [1641.5, 1852.75], [1638, 1875.75], [1648.25, 1901.5], [1648, 1911.5], [1644.25, 1954.25], [1635.75, 1990.25], [1597.75, 1964],
      [1562.5, 1921.5], [1505.75, 1887.25], [1531.5, 1860.25], [1550, 1825.25], [1551.25, 1802.75], [1544, 1788.25], [1524.75, 1774.5],
      [1549.75, 1732.25], [1562.75, 1698], [1564.75, 1652.25], [1560, 1616.5], [1565, 1592.75], [1589.75, 1569.75]
    ]
  },
  //НЕИЗВЕДАННЫЕ ЗЕМЛИ
  {
    name: 'КПП КОРЗУС-ЮНИОН', // Название города (будет крупно в подсказке)
    location: 'Неизведанные земли', // Название региона (будет выделено цветом)
    locationColor: '#E3E8DC', // Цвет для названия региона Нейтральные земли (#E3E8DC)
    desc: 'КПП связывает два биома - Корзус и Юнион.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/kpp-korzus-junion.1092/post-39905',
    polygon: [
      [1707.5, 2049.5], [1742, 2073], [1732, 2085], [1757, 2102.5], [1741.5, 2126.5], [1729, 2139.5], [1733.5, 2144.5], [1717, 2158.5], 
      [1717, 2172], [1683, 2191.5], [1671, 2195.5], [1628, 2178.5], [1630.5, 2150], [1648.5, 2134], [1702.5, 2049.5]
    ]
  },
  {
    name: 'КПП ЮНИОН-АРАМИДИС', // Название города (будет крупно в подсказке)
    location: 'Неизведанные земли', // Название региона (будет выделено цветом)
    locationColor: '#E3E8DC', // Цвет для названия региона Нейтральные земли (#E3E8DC)
    desc: 'КПП связывает два биома - Юнион и Арамидис.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/kpp-junion-aramidis.1175/post-46521',
    polygon: [
      [2884, 1804.5], [2906.5, 1824.75], [2941, 1873.25], [2932.5, 1890.75], [2959, 1910.75], [2971.25, 1929], [2927, 1978], [2864.5, 1999.5], 
      [2854, 2014.75], [2852.5, 2034], [2848.75, 2051.5], [2828.25, 2103.75], [2805.25, 2110.25], [2796, 2116.75], [2796.25, 2124], [2776.5, 2140.25], 
      [2754.75, 2155.75], [2744, 2166.25], [2731.5, 2166], [2719.25, 2161.5], [2710.5, 2145.75], [2709.75, 2129], [2710.5, 2115.25], 
      [2708.75, 2104.25], [2715.25, 2097.75], [2724.5, 2090], [2732, 2076.75], [2759.25, 2063.25], [2798.25, 2034], [2815.75, 1995.25], 
      [2842.75, 1935.25], [2844.75, 1903], [2847.5, 1890.5], [2832.75, 1870.25]
    ]
  },
  {
    name: 'КПП АРАМИДИС-КОРЗУС', // Название города (будет крупно в подсказке)
    location: 'Неизведанные земли', // Название региона (будет выделено цветом)
    locationColor: '#E3E8DC', // Цвет для названия региона Нейтральные земли (#E3E8DC)
    desc: 'КПП связывает два биома - Арамидис и Корзус.', // Описание (любой текст)
    forum: 'https://enterum.ru/index.php?threads/kpp-aramidis-korzus-vroklaj-siti.1002/post-29365',
    polygon: [
      [1690.5, 996.5], [1678.5, 1017.5], [1675.75, 1025.5], [1674.75, 1037.5], [1672.75, 1045.25], [1668, 1058.75], [1675.25, 1071], 
      [1690.25, 1075.5], [1708, 1088.5], [1722.75, 1090.25], [1735, 1068.25], [1740, 1042.5], [1751.75, 1020], [1740.25, 997.25]
    ]
  },
];

regions.forEach(region => {
  const shape = L.polygon(region.polygon, { color: 'transparent', weight: 0, fillOpacity: 0.2 });
  shape.addTo(map);
  shape.on('mouseover', function(e) {
    // Кастомная подсказка:
    // 1. Название города (region.name) — крупно
    // 2. Черта
    // 3. Локация (region.location) — цвет задаётся через region.locationColor
    // 4. Описание (region.desc) — просто текст
    const tooltipHtml = `
      <div style="padding:12px 18px; background:#222222; border-radius:5px; box-shadow:0 2px 12px #0002; min-width:230px; border:3px solid #00A6FF;">
        <div style="font-weight:bold; font-size:1.5em; color:#fff; margin-bottom:6px;">${region.name}</div>
        <hr style="margin:6px 0 8px 0; border:none; border-top:1.5px solid #484848;"/>
        <div style="margin-bottom:8px; font-size:1.08em; color:#9d9d9d;">
          <span style="font-weight:bold; color:#9d9d9d;">Регион: </span>
          <span style="color:${region.locationColor || '#3388ff'}; font-weight:bold;">${region.location || '—'}</span>
        </div>
        <div style="font-size:1em; color:#9d9d9d; white-space:pre-line;">${region.desc || ''}</div>
      </div>
    `;
    this.setStyle({ color: 'orange', fillOpacity: 0.4 });
    this.bindTooltip(tooltipHtml, {sticky: true, direction: 'top', className: 'custom-tooltip'}).openTooltip();
  });
  shape.on('mouseout', function(e) {
    this.setStyle({ color: 'transparent', fillOpacity: 0.2 });
    this.closeTooltip();
  });
  shape.on('click', function() {
    window.open(region.forum, '_blank');
  });
});

map.on('click', function(e) {
  // Для CRS.Simple координаты e.latlng соответствуют [y, x]
  console.log('Координаты клика:', e.latlng);
});
